lib/tasks/dev.rake

  task add_coins: :environment do
    # order: title | acronym | image_url
    coins_list = [
      [
        "Bitcoin",
        "BTC",
        "http://pngimg.com/uploads/bitcoin/bitcoin_PNG47.png",
        MiningType.find_by(acronym: "PoW")
      ],
      [
        "Ethereum",
        "ETH",
        "https://banner2.kisspng.com/20180330/wae/kisspng-ethereum-bitcoin-cryptocurrency-logo-tether-bitcoin-5abdfe01b6f4b4.2459439115224007697494.jpg",
        MiningType.all.sample
      ],
      [
        "Ripple",
        "XRP",
        "https://cdn4.iconfinder.com/data/icons/crypto-currency-and-coin-2/256/ripple_xrp_coin-512.png",
        MiningType.all.sample
      ],
      [
        "Litecoin",
        "LTC",
        "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f8/LTC-400.png/220px-LTC-400.png",
        MiningType.all.sample
      ],
      [
        "Binance Coin",
        "BNB",
        "https://assets.coingecko.com/coins/images/825/large/binance-coin-logo.png",
        MiningType.all.sample
      ],
      [
        "Tether",
        "USDT",
        "http://icons.iconarchive.com/icons/cjdowner/cryptocurrency-flat/1024/Tether-USDT-icon.png",
        MiningType.all.sample
      ],
    ]
---
SELECT  "mining_types".* FROM "mining_types" WHERE "mining_types"."acronym" = ? LIMIT ?  [["acronym", "PoW"], ["LIMIT", 1]]
SELECT "mining_types".* FROM "mining_types"


    coins_list.each do |title, acronym, image_url, mining_type|
      puts mining_type
      Coin.find_or_create_by!(
        title: title,
        acronym: acronym,
        image_url: image_url,
        mining_type: mining_type
      )
---
INSERT INTO "coins" ("title", "acronym", "image_url", "created_at", "updated_at", "mining_type_id") VALUES (?, ?, ?, ?, ?, ?)
SELECT  "coins".* FROM "coins" WHERE "coins"."title" = ? AND "coins"."acronym" = ? AND "coins"."image_url" = ? AND "coins"."mining_type_id" = ? LIMIT ?  [["title", "Bitcoin"], ["acronym", "BTC"], ["image_url", "http://pngimg.com/uploads/bitcoin/bitcoin_PNG47.png"], ["mining_type_id", 2], ["LIMIT", 1]]

  task add_mining_types: :environment do
    # order: title | acronym
    type_mining_list = [
      ["Proof of Stake", "PoS"],
      ["Proof of Work", "PoW"],
      ["Proof of Capacity", "PoC"]
    ]
    spinner = TTY::Spinner.new("[:spinner] Executando tarefa: Adicionando moedas ...", format: :pulse_2)
    spinner.auto_spin

    type_mining_list.each do |title, acronym|
      MiningType.find_or_create_by!(
        title: title,
        acronym: acronym
      )
---
INSERT INTO "mining_types" ("title", "acronym", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Proof of Stake"], ["acronym", "PoS"], ["created_at", "2019-06-02 14:08:18.579357"], ["updated_at", "2019-06-02 14:08:18.579357"]]
SELECT  "mining_types".* FROM "mining_types" WHERE "mining_types"."title" = ? AND "mining_types"."acronym" = ? LIMIT ?  [["title", "Proof of Stake"], ["acronym", "PoS"], ["LIMIT", 1]]