app/controllers/mining_types_controller.rb

SELECT "mining_types".* FROM "mining_types"
---
  def index
    @mining_types = MiningType.all

SELECT  "mining_types".* FROM "mining_types" WHERE "mining_types"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_mining_type
      @mining_type = MiningType.find(params[:id])