app/views/coins/index.html.erb


<h1><%= Coin.model_name.human(count: @coins.count)  %></h1>
---
SELECT "coins".* FROM "coins"
SELECT COUNT(*) FROM "coins"